import os
from os import path as p
import time
import sys
import re

def strip_ansi_codes(text):
    """Remove ANSI color codes from a string."""
    ansiPattern = re.compile('\\033\\[[0-9;]*m')
    return ansiPattern.sub('', text)

def show_getting_mm_total(torsionTag):
    greenText = '\x1b[32m'
    redText = '\x1b[31m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    tealText = '\x1b[38;5;37m'
    brightGreenText = '\x1b[92m'
    text = f"{yellowText}🗲🗲{resetTextColor}{' ' * 8}Fitting torsion parameters for {greenText}{torsionTag}"
    visibleText = strip_ansi_codes(text)
    nSpaces = 102 - len(visibleText) - 3
    text += f"{' ' * nSpaces}{yellowText}🗲🗲{resetTextColor}"
    sys.stdout.write('\r\x1b[K' + text)
    sys.stdout.flush()

def show_need_cgenff_str(cappedMol2) -> None:
    greenText = '\x1b[32m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    lightningBar = '🗲 ' * int(80 // 2)
    pausedAscii = '\n            ██████╗  █████╗ ██╗   ██╗███████╗███████╗██████╗ \n            ██╔══██╗██╔══██╗██║   ██║██╔════╝██╔════╝██╔══██╗\n            ██████╔╝███████║██║   ██║███████╗█████╗  ██║  ██║\n            ██╔═══╝ ██╔══██║██║   ██║╚════██║██╔══╝  ██║  ██║\n            ██║     ██║  ██║╚██████╔╝███████║███████╗██████╔╝\n            ╚═╝     ╚═╝  ╚═╝ ╚═════╝ ╚══════╝╚══════╝╚═════╝ \n                              '
    needStrText = f"""CHARMM parameterisation procedure requires a {orangeText}stream (.STR){resetTextColor} file.\nAs you don't have CGenFF installed locally,\nyou can  use the CGenFF webserver to generate this:\n1. Go to {greenText}https://cgenff.com/{resetTextColor}\n2. Create an account and log in\n3. Select "Start CGenFF Job"\n4. Upload the following MOL2 file:\n{greenText}{cappedMol2}{resetTextColor}\n\nOnce CGenFF has finished running:\nPlace the {orangeText}stream (.STR){resetTextColor} file in your specified inputDir\nand re-run drFrankenstein with the same config file"""
    getLocalText = f'\n{yellowText}NOTE that if you want to run this protocol in a\nfully automated manner, you can request the CGenFF binaries\nby emailing: {orangeText}info@silcsbio.com{yellowText}\nNOTE: make sure you CC your PI into this email!\n\nOnce you have the binary, supply the location in the\n{greenText}pathInfo.cgenffExe{yellowText} entry in your config file'
    print(f'{yellowText}{lightningBar}{resetTextColor}')
    print(f'{greenText}{pausedAscii}{resetTextColor}')
    print(f'{yellowText}{lightningBar}{resetTextColor}')
    print(f'{resetTextColor}{needStrText}{resetTextColor}')
    print(f'{getLocalText}')
    print(f'{yellowText}{lightningBar}{resetTextColor}')

def show_config_error(errors: dict) -> None:
    greenText = '\x1b[32m'
    redText = '\x1b[31m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    redText = '\x1b[31m'
    lightningBar = '🗲 ' * int(94 // 2)
    configErrorAscii = f'\n ▄████▄  ▒█████   ███▄    █   █████▒██▓ ▄████    ▓█████  ██▀███   ██▀███   ▒█████   ██▀███  \n▒██▀ ▀█ ▒██▒  ██▒ ██ ▀█   █ ▓██   ▒▓██▒██▒ ▀█▒   ▓█   ▀ ▓██ ▒ ██▒▓██ ▒ ██▒▒██▒  ██▒▓██ ▒ ██▒\n▒▓█    ▄▒██░  ██▒▓██  ▀█ ██▒▒████ ░▒██▒██░▄▄▄░   ▒███   ▓██ ░▄█ ▒▓██ ░▄█ ▒▒██░  ██▒▓██ ░▄█ ▒\n▒▓▓▄ ▄██▒██   ██░▓██▒  ▐▌██▒░▓█▒  ░░██░▓█  ██▓   ▒▓█  ▄ ▒██▀▀█▄  ▒██▀▀█▄  ▒██   ██░▒██▀▀█▄  \n▒ ▓███▀ ░ ████▓▒░▒██░   ▓██░░▒█░   ░██░▒▓███▀▒   ░▒████▒░██▓ ▒██▒░██▓ ▒██▒░ ████▓▒░░██▓ ▒██▒\n░ ░▒ ▒  ░ ▒░▒░▒░ ░ ▒░   ▒ ▒  ▒ ░   ░▓  ░▒   ▒    ░░ ▒░ ░░ ▒▓ ░▒▓░░ ▒▓ ░▒▓░░ ▒░▒░▒░ ░ ▒▓ ░▒▓░\n  ░  ▒    ░ ▒ ▒░ ░ ░░   ░ ▒░ ░      ▒ ░ ░   ░     ░ ░  ░  ░▒ ░ ▒░  ░▒ ░ ▒░  ░ ▒ ▒░   ░▒ ░ ▒░\n░       ░ ░ ░ ▒     ░   ░ ░  ░ ░    ▒ ░ ░   ░       ░     ░░   ░   ░░   ░ ░ ░ ░ ▒    ░░   ░ \n░ ░         ░ ░           ░         ░       ░       ░  ░   ░        ░         ░ ░     ░     \n░          \n'
    print(f'{yellowText}{lightningBar}{redText}{configErrorAscii}{resetTextColor}\n')
    print(f'{yellowText}\tThe following errors were found in your config file:{resetTextColor}')
    for (key, value) in errors.items():
        print(f'{yellowText}🗲  {orangeText}{key}:\n\t{redText}{value}{resetTextColor}\n')
    print(f'{yellowText}\tPlease consult the README for more details.{resetTextColor}')
    print(f'{yellowText}{lightningBar}{resetTextColor}')

def show_wriggle_splash() -> None:
    greenText = '\x1b[32m'
    redText = '\x1b[31m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    lightningBar = '🗲 ' * int(86 // 2)
    aciiWriggle = '\n ▄█     █▄     ▄████████  ▄█     ▄██████▄     ▄██████▄   ▄█          ▄████████    ▄█ \n███     ███   ███    ███ ███    ███    ███   ███    ███ ███         ███    ███   ███ \n███     ███   ███    ███ ███▌   ███    █▀    ███    █▀  ███         ███    █▀    ███▌\n███     ███  ▄███▄▄▄▄██▀ ███▌  ▄███         ▄███        ███        ▄███▄▄▄       ███▌\n███     ███ ▀▀███▀▀▀▀▀   ███▌ ▀▀███ ████▄  ▀▀███ ████▄  ███       ▀▀███▀▀▀       ███\n███     ███ ▀███████████ ███    ███    ███   ███    ███ ███         ███    █▄    █▀ \n███ ▄█▄ ███   ███    ███ ███    ███    ███   ███    ███ ███▌    ▄   ███    ███    \n ▀███▀███▀    ███    ███ █▀     ████████▀    ████████▀  █████▄▄██   ██████████   ██\n              ███    ███                                                         \n'
    print(yellowText + lightningBar + resetTextColor + aciiWriggle + yellowText + ' ' * 24 + 'GENERATING CONFORMERS WITH GOAT...\n' + lightningBar + resetTextColor)

def show_twist_splash() -> None:
    greenText = '\x1b[32m'
    redText = '\x1b[31m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    tealText = '\x1b[38;5;37m'
    brightGreenText = '\x1b[92m'
    lightningBar = '🗲 ' * int(124 // 2)
    asciiTorsionScanning = '\n\n████████▄   ▄██████▄          ███        ▄█    █▄       ▄████████         ███      ▄█     █▄   ▄█     ▄████████     ███     \n███   ▀███ ███    ███     ▀█████████▄   ███    ███     ███    ███     ▀█████████▄ ███     ███ ███    ███    ███ ▀█████████▄ \n███    ███ ███    ███        ▀███▀▀██   ███    ███     ███    █▀         ▀███▀▀██ ███     ███ ███▌   ███    █▀     ▀███▀▀██ \n███    ███ ███    ███         ███   ▀  ▄███▄▄▄▄███▄▄  ▄███▄▄▄             ███   ▀ ███     ███ ███▌   ███            ███   ▀ \n███    ███ ███    ███         ███     ▀▀███▀▀▀▀███▀  ▀▀███▀▀▀             ███     ███     ███ ███▌ ▀███████████     ███     \n███    ███ ███    ███         ███       ███    ███     ███    █▄          ███     ███     ███ ███           ███     ███     \n███   ▄███ ███    ███         ███       ███    ███     ███    ███         ███     ███ ▄█▄ ███ ███     ▄█    ███     ███     \n████████▀   ▀██████▀         ▄████▀     ███    █▀      ██████████        ▄████▀    ▀███▀███▀  █▀    ▄████████▀     ▄████▀   \n                                                                                                                                                                                                                                                         \n'
    print(yellowText + lightningBar + resetTextColor + asciiTorsionScanning + yellowText + ' ' * 42 + 'SCANNING TORSION ANGLES...\n' + lightningBar + resetTextColor)

def show_charge_splash() -> None:
    greenText = '\x1b[32m'
    redText = '\x1b[31m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    tealText = '\x1b[38;5;37m'
    brightGreenText = '\x1b[92m'
    lightningBar = '🗲 ' * int(127 // 2)
    asciiCharge = '\n ▄████████    ▄█    █▄       ▄████████    ▄████████    ▄██████▄     ▄████████      ▄█      ███         ███    █▄     ▄███████▄ \n███    ███   ███    ███     ███    ███   ███    ███   ███    ███   ███    ███     ███  ▀█████████▄     ███    ███   ███    ███ \n███    █▀    ███    ███     ███    ███   ███    ███   ███    █▀    ███    █▀      ███▌    ▀███▀▀██     ███    ███   ███    ███ \n███         ▄███▄▄▄▄███▄▄   ███    ███  ▄███▄▄▄▄██▀  ▄███         ▄███▄▄▄         ███▌     ███   ▀     ███    ███   ███    ███ \n███        ▀▀███▀▀▀▀███▀  ▀███████████ ▀▀███▀▀▀▀▀   ▀▀███ ████▄  ▀▀███▀▀▀         ███▌     ███         ███    ███ ▀█████████▀  \n███    █▄    ███    ███     ███    ███ ▀███████████   ███    ███   ███    █▄      ███      ███         ███    ███   ███        \n███    ███   ███    ███     ███    ███   ███    ███   ███    ███   ███    ███     ███      ███         ███    ███   ███        \n████████▀    ███    █▀      ███    █▀    ███    ███   ████████▀    ██████████     █▀      ▄████▀       ████████▀   ▄████▀      \n                                         ███    ███                                                                                                                                                                                                          \n'
    print(yellowText + lightningBar + resetTextColor + asciiCharge + yellowText + ' ' * 42 + 'RUNNING CHARGE CALCULATIONS...\n' + lightningBar + resetTextColor)

def show_torsion_being_scanned(torsionTag, torsionIndex, nTorsions) -> None:
    greenText = '\x1b[32m'
    redText = '\x1b[31m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    tealText = '\x1b[38;5;37m'
    textToPrint = f"{yellowText}🗲 🗲{' ' * 8}SCANNING TORSION:{' ' * 8}[{' ' * 1}{greenText}{torsionTag}{yellowText}{' ' * 1}]{' ' * 8}{resetTextColor}({torsionIndex + 1}/{nTorsions}){yellowText}"
    visibleText = strip_ansi_codes(textToPrint)
    nSpaces = 124 - len(visibleText) - 3
    textToPrint += f"{' ' * nSpaces}{yellowText}🗲🗲{resetTextColor}"
    print(textToPrint)

def show_stitch_splash() -> None:
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    lightningBar = '🗲 ' * int(102 // 2)
    asciiStitch = '\n        ▄████████     ███      ▄█      ███      ▄████████    ▄█    █▄         ▄█      ███             \n       ███    ███ ▀█████████▄ ███  ▀█████████▄ ███    ███   ███    ███       ███  ▀█████████▄         \n       ███    █▀     ▀███▀▀██ ███▌    ▀███▀▀██ ███    █▀    ███    ███       ███▌    ▀███▀▀██         \n       ███            ███   ▀ ███▌     ███   ▀ ███         ▄███▄▄▄▄███▄▄     ███▌     ███   ▀         \n     ▀███████████     ███     ███▌     ███     ███        ▀▀███▀▀▀▀███▀      ███▌     ███             \n              ███     ███     ███      ███     ███    █▄    ███    ███       ███      ███             \n        ▄█    ███     ███     ███      ███     ███    ███   ███    ███       ███      ███             \n      ▄████████▀     ▄████▀   █▀      ▄████▀   ████████▀    ███    █▀        █▀      ▄████▀           \n                                                                                                      \n    ███      ▄██████▄     ▄██████▄     ▄████████     ███        ▄█    █▄       ▄████████    ▄████████ \n▀█████████▄ ███    ███   ███    ███   ███    ███ ▀█████████▄   ███    ███     ███    ███   ███    ███ \n   ▀███▀▀██ ███    ███   ███    █▀    ███    █▀     ▀███▀▀██   ███    ███     ███    █▀    ███    ███ \n    ███   ▀ ███    ███  ▄███         ▄███▄▄▄         ███   ▀  ▄███▄▄▄▄███▄▄  ▄███▄▄▄      ▄███▄▄▄▄██▀ \n    ███     ███    ███ ▀▀███ ████▄  ▀▀███▀▀▀         ███     ▀▀███▀▀▀▀███▀  ▀▀███▀▀▀     ▀▀███▀▀▀▀▀   \n    ███     ███    ███   ███    ███   ███    █▄      ███       ███    ███     ███    █▄  ▀███████████ \n    ███     ███    ███   ███    ███   ███    ███     ███       ███    ███     ███    ███   ███    ███ \n   ▄████▀    ▀██████▀    ████████▀    ██████████    ▄████▀     ███    █▀      ██████████   ███    ███ \n                                                                                           ███    ███ \n'
    print(yellowText + lightningBar + resetTextColor + asciiStitch + yellowText + ' ' * 42 + 'FITTING PARAMETERS TO QM SCAN DATA...\n' + lightningBar + resetTextColor)

def show_creation_splash() -> None:
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    lightningBar = '🗲 ' * int(76 // 2)
    asciiCreation = '\n▀█████████▄     ▄████████  ▄█  ███▄▄▄▄      ▄██████▄       ▄█      ███         \n  ███    ███   ███    ███ ███  ███▀▀▀██▄   ███    ███     ███  ▀█████████▄     \n  ███    ███   ███    ███ ███▌ ███   ███   ███    █▀      ███▌    ▀███▀▀██     \n ▄███▄▄▄██▀   ▄███▄▄▄▄██▀ ███▌ ███   ███  ▄███            ███▌     ███   ▀     \n▀▀███▀▀▀██▄  ▀▀███▀▀▀▀▀   ███▌ ███   ███ ▀▀███ ████▄      ███▌     ███         \n  ███    ██▄ ▀███████████ ███  ███   ███   ███    ███     ███      ███         \n  ███    ███   ███    ███ ███  ███   ███   ███    ███     ███      ███         \n▄█████████▀    ███    ███ █▀    ▀█   █▀    ████████▀      █▀      ▄████▀       \n               ███    ███                                                      \n    ███      ▄██████▄       ▄█        ▄█     ▄████████    ▄████████            \n▀█████████▄ ███    ███     ███       ███    ███    ███   ███    ███            \n   ▀███▀▀██ ███    ███     ███       ███▌   ███    █▀    ███    █▀             \n    ███   ▀ ███    ███     ███       ███▌  ▄███▄▄▄      ▄███▄▄▄                \n    ███     ███    ███     ███       ███▌ ▀▀███▀▀▀     ▀▀███▀▀▀                \n    ███     ███    ███     ███       ███    ███          ███    █▄             \n    ███     ███    ███     ███▌    ▄ ███    ███          ███    ███            \n   ▄████▀    ▀██████▀      █████▄▄██ █▀     ███          ██████████            \n                           ▀                                                   \n'
    print(yellowText + lightningBar + resetTextColor + asciiCreation + yellowText + ' ' * 10 + 'FITTING PARAMETERS TO QM SCAN DATA...\n' + lightningBar + resetTextColor)
import time
import os
import sys

def show_what_have_we_created(config):
    moleculeName = config['moleculeInfo']['moleculeName']
    reportHtml = config['runtimeInfo']['madeByReporting']['reportHtml']
    forcefield = config['parameterFittingInfo']['forceField']
    art = [' █     █░ ██░ ██  ▄▄▄     ▄▄▄█████▓    ██░ ██  ▄▄▄    ██▒   █▓▓█████           ', '▓█░ █ ░█░▓██░ ██▒▒████▄   ▓  ██▒ ▓▒   ▓██░ ██▒▒████▄ ▓██░   █▒▓█   ▀           ', '▒█░ █ ░█ ▒██▀▀██░▒██  ▀█▄ ▒ ▓██░ ▒░   ▒██▀▀██░▒██  ▀█▄▓██  █▒░▒███             ', '░█░ █ ░█ ░▓█ ░██ ░██▄▄▄▄██░ ▓██▓ ░    ░▓█ ░██ ░██▄▄▄▄██▒██ █░░▒▓█  ▄           ', '░░██▒██▓ ░▓█▒░██▓ ▓█   ▓██▒ ▒██▒ ░    ░▓█▒░██▓ ▓█   ▓██▒▒▀█░  ░▒████▒          ', '░ ▓░▒ ▒   ▒ ░░▒░▒ ▒▒   ▓▒█░ ▒ ░░       ▒ ░░▒░▒ ▒▒   ▓▒█░░ ▐░  ░░ ▒░ ░          ', '  ▒ ░ ░   ▒ ░▒░ ░  ▒   ▒▒ ░   ░        ▒ ░▒░ ░  ▒   ▒▒ ░░ ░░   ░ ░  ░          ', '  ░   ░   ░  ░░ ░  ░   ▒    ░          ░  ░░ ░  ░   ▒     ░░     ░             ', '    ░     ░  ░  ░      ░  ░            ░  ░  ░      ░  ░   ░     ░  ░          ', '                                                                               ', '                            █     █░▓█████                                     ', '                           ▓█░ █ ░█░▓█   ▀                                     ', '                           ▒█░ █ ░█ ▒███                                       ', '                           ░█░ █ ░█ ▒▓█  ▄                                     ', '                           ░░██▒██▓ ░▒████▒                                    ', '                           ░ ▓░▒ ▒  ░░ ▒░ ░                                    ', '                             ▒ ░ ░   ░ ░  ░                                    ', '                             ░   ░     ░                                       ', '                               ░       ░  ░                                    ', ' ▄████▄  ██▀███  ▓█████ ▄▄▄     ▄▄▄█████▓▓█████ ▓█████▄    ▄▄██▓     ▄▄██▓     ', '▒██▀ ▀█ ▓██ ▒ ██▒▓█   ▀▒████▄   ▓  ██▒ ▓▒▓█   ▀ ▒██▀ ██▌  ▓█████▒   ▓█████▒    ', '▒▓█    ▄▓██ ░▄█ ▒▒███  ▒██  ▀█▄ ▒ ▓██░ ▒░▒███   ░██   █▌  ██   ██   ██   ██    ', '▒▓▓▄ ▄██▒██▀▀█▄  ▒▓█  ▄░██▄▄▄▄██░ ▓██▓ ░ ▒▓█  ▄ ░▓█▄   ▌  ▒   █▓    ▒   █▓     ', '▒ ▓███▀ ░██▓ ▒██▒░▒████▒▓█   ▓██▒ ▒██▒ ░ ░▒████▒░▒████▓   ▒  ██▒    ▒  ██▒     ', '░ ░▒ ▒  ░ ▒▓ ░▒▓░░░ ▒░ ░▒▒   ▓▒█░ ▒ ░░   ░░ ▒░ ░ ▒▒▓  ▒     ██ ▒      ██ ▒     ', '  ░  ▒    ░▒ ░ ▒░ ░ ░  ░ ▒   ▒▒ ░   ░     ░ ░  ░ ░ ▒  ▒        ▒         ▒     ', '░         ░░   ░    ░    ░   ▒    ░         ░    ░ ░  ░     ██▓       ██▓      ', '░ ░        ░        ░  ░     ░  ░           ░  ░   ░        ▒         ▒        ', '░                                                ░          ▒         ▒        ']

    def clear_terminal():
        os.system('cls' if os.name == 'nt' else 'clear')
    duration = 3
    framesPerSecond = 60
    totalFrames = duration * framesPerSecond
    maxShift = 2
    greenText = '\x1b[32m'
    resetColor = '\x1b[0m'
    for frame in range(totalFrames):
        clear_terminal()
        import math
        shift = int(maxShift * math.sin(frame * 0.5))
        for line in art:
            padding = ' ' * (maxShift + shift)
            print(f'{padding}{greenText}{line}{resetColor}')
        time.sleep(1 / framesPerSecond)
    clear_terminal()
    for line in art:
        print(f"{' ' * maxShift}{greenText}{line}{resetColor}")
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    print(' ' * 16 + yellowText + f'{forcefield} PARAMETERS FOR YOUR MOLECULE:' + ' ' * 4 + greenText + moleculeName + resetTextColor)
    print()
    print(' ' * 16 + yellowText + f'VIEW REPORT AT:\n' + ' ' * 4 + f'{greenText}{reportHtml}{resetTextColor}')

def print_botched(errorReport) -> None:
    greenText = '\x1b[32m'
    redText = '\x1b[31m'
    orangeText = '\x1b[38;5;172m'
    yellowText = '\x1b[33m'
    resetTextColor = '\x1b[0m'
    tealColor = '\x1b[38;5;37m'
    print(redText + f'\n🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲\n\n                ▄▄▄▄    ▒█████  ▄▄▄█████▓ ▄████▄   ██░ ██ ▓█████ ▓█████▄  ▐██▌ \n                ▓█████▄ ▒██▒  ██▒▓  ██▒ ▓▒▒██▀ ▀█  ▓██░ ██▒▓█   ▀ ▒██▀ ██▌ ▐██▌ \n                ▒██▒ ▄██▒██░  ██▒▒ ▓██░ ▒░▒▓█    ▄ ▒██▀▀██░▒███   ░██   █▌ ▐██▌ \n                ▒██░█▀  ▒██   ██░░ ▓██▓ ░ ▒▓▓▄ ▄██▒░▓█ ░██ ▒▓█  ▄ ░▓█▄   ▌ ▓██▒ \n                ░▓█  ▀█▓░ ████▓▒░  ▒██▒ ░ ▒ ▓███▀ ░░▓█▒░██▓░▒████▒░▒████▓  ▒▄▄  \n                ░▒▓███▀▒░ ▒░▒░▒░   ▒ ░░   ░ ░▒ ▒  ░ ▒ ░░▒░▒░░ ▒░ ░ ▒▒▓  ▒  ░▀▀▒ \n                ▒░▒   ░   ░ ▒ ▒░     ░      ░  ▒    ▒ ░▒░ ░ ░ ░  ░ ░ ▒  ▒  ░  ░ \n                ░    ░ ░ ░ ░ ▒    ░      ░         ░  ░░ ░   ░    ░ ░  ░     ░ \n                ░          ░ ░           ░ ░       ░  ░  ░   ░  ░   ░     ░    \n                    ░                   ░                        ░          \n🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲\n          ' + resetTextColor)
    if errorReport is not None:
        print(f"{redText}{' ' * 7}🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲{resetTextColor}")
        print(f"{' ' * 7}For System:\t\t{yellowText}{errorReport['pdbName']}{resetTextColor}")
        print('')
        print(f"{tealColor}{' ' * 7}{'#' * 4}{' ' * 7}Traceback{' ' * 7}{'#' * 4}{resetTextColor}")
        print(f"{' ' * 7}In Script:\t\t{orangeText}{errorReport['scriptName']}{resetTextColor}")
        print(f"{' ' * 7}In Function:\t\t{orangeText}{errorReport['functionName']}{resetTextColor}")
        print(f"{' ' * 7}With Error:\t\t{redText}{errorReport['errorType']}{resetTextColor}")
        print(f"{' ' * 7}With Message:\t\t{redText}{errorReport['errorMessage']}{resetTextColor}")
        print(f"{' ' * 7}At Line Number:\t\t{redText}{errorReport['lineNumber']}{resetTextColor}")
        print(f"{tealColor}{' ' * 7}{'#' * 4}{' ' * 7}Full Debug Traceback{' ' * 7}{'#' * 4}{resetTextColor}")
        print(f"\t{orangeText}{'LINE NUMBER':<10}{yellowText}{'FUNCTION':>30}{resetTextColor}\t/path/to/crashed/{tealColor}script_name.py{resetTextColor}")
        print(f"\t{'---':<10}{'---':>30}\t{'---'}")
        for tracebackLine in errorReport['fullTraceBack']:
            scriptPath = tracebackLine.split(':')[0]
            scriptDir = p.dirname(scriptPath)
            scriptName = p.basename(scriptPath)
            lineNumber = tracebackLine.split(':')[1].split('in')[0].strip()
            functionName = tracebackLine.split(':')[1].split('in')[1].strip()
            print(f'\t{orangeText}{lineNumber:<10}{yellowText}{functionName:>30}{resetTextColor}\t{scriptDir}/{tealColor}{scriptName}{resetTextColor}')
    print(f'{redText}🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲')
    print(resetTextColor)
if __name__ == '__main__':
    show_wriggle_splash()
    show_twist_splash()
    show_charge_splash()
    show_torsion_being_scanned('N-C-CA-CB', 1, 10)
    show_stitch_splash()
    show_creation_splash()
    show_what_have_we_created('ALANINE')