import os 
from os import path as p

#🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲
def show_twist_splash() -> None:

    ## using font Delta Corps Priest 1
    greenText = "\033[32m"
    redText = "\033[31m"
    orangeText = "\033[38;5;172m"
    yellowText = "\033[33m"
    resetTextColor = "\033[0m"
    tealText = "\033[38;5;37m" 
    brightGreenText = "\033[92m"

    lightningBar = "🗲"*124
    asciiTorsionScanning = """

████████▄   ▄██████▄          ███        ▄█    █▄       ▄████████         ███      ▄█     █▄   ▄█     ▄████████     ███     
███   ▀███ ███    ███     ▀█████████▄   ███    ███     ███    ███     ▀█████████▄ ███     ███ ███    ███    ███ ▀█████████▄ 
███    ███ ███    ███        ▀███▀▀██   ███    ███     ███    █▀         ▀███▀▀██ ███     ███ ███▌   ███    █▀     ▀███▀▀██ 
███    ███ ███    ███         ███   ▀  ▄███▄▄▄▄███▄▄  ▄███▄▄▄             ███   ▀ ███     ███ ███▌   ███            ███   ▀ 
███    ███ ███    ███         ███     ▀▀███▀▀▀▀███▀  ▀▀███▀▀▀             ███     ███     ███ ███▌ ▀███████████     ███     
███    ███ ███    ███         ███       ███    ███     ███    █▄          ███     ███     ███ ███           ███     ███     
███   ▄███ ███    ███         ███       ███    ███     ███    ███         ███     ███ ▄█▄ ███ ███     ▄█    ███     ███     
████████▀   ▀██████▀         ▄████▀     ███    █▀      ██████████        ▄████▀    ▀███▀███▀  █▀    ▄████████▀     ▄████▀   
                                                                                                                                                                                                                                                         
"""

    print(yellowText + lightningBar +
           resetTextColor + asciiTorsionScanning  +
             yellowText + " "*42 + "SCANNING TORSION ANGLES...\n" + 
             lightningBar + resetTextColor)

#🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲
def show_torsion_being_scanned(torsionTag, torsionIndex, nTorsions) -> None:
    greenText = "\033[32m"
    redText = "\033[31m"
    orangeText = "\033[38;5;172m"
    yellowText = "\033[33m"
    resetTextColor = "\033[0m"
    tealText = "\033[38;5;37m"     
    print(f"{yellowText}Scanning torsion {greenText}{torsionTag}{yellowText} ({torsionIndex+1}/{nTorsions})")


#🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲
def print_botched(errorReport) -> None:
    greenText = "\033[32m"
    redText = "\033[31m"
    orangeText = "\033[38;5;172m"
    yellowText = "\033[33m"
    resetTextColor = "\033[0m"
    tealColor = "\033[38;5;37m" 

    # run(["clear"])
    print(redText+
          f"""
🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲

                ▄▄▄▄    ▒█████  ▄▄▄█████▓ ▄████▄   ██░ ██ ▓█████ ▓█████▄  ▐██▌ 
                ▓█████▄ ▒██▒  ██▒▓  ██▒ ▓▒▒██▀ ▀█  ▓██░ ██▒▓█   ▀ ▒██▀ ██▌ ▐██▌ 
                ▒██▒ ▄██▒██░  ██▒▒ ▓██░ ▒░▒▓█    ▄ ▒██▀▀██░▒███   ░██   █▌ ▐██▌ 
                ▒██░█▀  ▒██   ██░░ ▓██▓ ░ ▒▓▓▄ ▄██▒░▓█ ░██ ▒▓█  ▄ ░▓█▄   ▌ ▓██▒ 
                ░▓█  ▀█▓░ ████▓▒░  ▒██▒ ░ ▒ ▓███▀ ░░▓█▒░██▓░▒████▒░▒████▓  ▒▄▄  
                ░▒▓███▀▒░ ▒░▒░▒░   ▒ ░░   ░ ░▒ ▒  ░ ▒ ░░▒░▒░░ ▒░ ░ ▒▒▓  ▒  ░▀▀▒ 
                ▒░▒   ░   ░ ▒ ▒░     ░      ░  ▒    ▒ ░▒░ ░ ░ ░  ░ ░ ▒  ▒  ░  ░ 
                ░    ░ ░ ░ ░ ▒    ░      ░         ░  ░░ ░   ░    ░ ░  ░     ░ 
                ░          ░ ░           ░ ░       ░  ░  ░   ░  ░   ░     ░    
                    ░                   ░                        ░          
🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲
          """
          +resetTextColor)
    

    if errorReport is not None:
        print(f"{redText}{' '*7}🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲{resetTextColor}")
        print(f"{' '*7}For System:\t\t{yellowText}{errorReport['pdbName']}{resetTextColor}")
        print("")
        print(f"{tealColor}{' '*7}{'#'*4}{' '*7}Traceback{' '*7}{'#'*4}{resetTextColor}")
        print(f"{' '*7}In Script:\t\t{orangeText}{errorReport['scriptName']}{resetTextColor}")
        print(f"{' '*7}In Function:\t\t{orangeText}{errorReport['functionName']}{resetTextColor}")


        print(f"{' '*7}With Error:\t\t{redText}{errorReport['errorType']}{resetTextColor}")
        print(f"{' '*7}With Message:\t\t{redText}{errorReport['errorMessage']}{resetTextColor}")
        print(f"{' '*7}At Line Number:\t\t{redText}{errorReport['lineNumber']}{resetTextColor}")

        print(f"{tealColor}{' '*7}{'#'*4}{' '*7}Full Debug Traceback{' '*7}{'#'*4}{resetTextColor}")

        print(f"\t{orangeText}{'LINE NUMBER':<10}{yellowText}{'FUNCTION':>30}{resetTextColor}\t/path/to/crashed/{tealColor}script_name.py{resetTextColor}")
        print(f"\t{'---':<10}{'---':>30}\t{'---'}")
        for tracebackLine in errorReport["fullTraceBack"]:
            scriptPath = tracebackLine.split(":")[0]
            scriptDir = p.dirname(scriptPath)
            scriptName = p.basename(scriptPath)
            lineNumber = tracebackLine.split(":")[1].split("in")[0].strip()
            functionName = tracebackLine.split(":")[1].split("in")[1].strip()
            print(f"\t{orangeText}{lineNumber:<10}{yellowText}{functionName:>30}{resetTextColor}\t{scriptDir}/{tealColor}{scriptName}{resetTextColor}")
    print(f"{redText}🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲🗲")
    print(resetTextColor)


if __name__ == "__main__":
    show_twist_splash()
    show_torsion_being_scanned("N-C-CA-CB", 1, 10)